letalvoj/StackChan/firmware/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.4 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_LANGUAGE_EN_US=y
CONFIG_BOARD_TYPE_M5STACK_STACK_CHAN=y

# USB networking (CDC-NCM). The device enumerates as a network adapter rather than a
# serial port, so the stock WebsocketProtocol runs over USB with no bespoke wire format.
#
# TinyUSB claims the USB-OTG peripheral on GPIO19/20, the same pins USB-Serial-JTAG uses.
CONFIG_CONNECTION_TYPE_USB_NCM=y
CONFIG_TINYUSB_NET_MODE_NCM=y
# The device listens rather than dials, so esp_http_server needs WebSocket support.
CONFIG_HTTPD_WS_SUPPORT=y
# Kept ON: USB-Serial-JTAG owns the PHY until tinyusb_driver_install() switches it to
# OTG, so the early boot log is readable over USB before networking comes up.
CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG=y

# Composite device: NCM *and* CDC-ACM on the same cable. Networking carries the protocol
# while the CDC interface carries ESP_LOG, so the device stays debuggable after TinyUSB
# takes the PHY. Without this, enabling USB networking makes the device go completely
# silent -- which cost several blind flash cycles to learn.
CONFIG_TINYUSB_CDC_ENABLED=y
CONFIG_TINYUSB_CDC_COUNT=1

CONFIG_SEND_WAKE_WORD_DATA=n
CONFIG_SR_WN_WN9_HISTACKCHAN_TTS3=y
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_COMPILER_CXX_EXCEPTIONS=y
CONFIG_COMPILER_CXX_EXCEPTIONS_EMG_POOL_SIZE=1024
CONFIG_COMPILER_CXX_RTTI=y
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_EXTERNAL=y
CONFIG_BT_NIMBLE_ENABLE_CONN_REATTEMPT=n
CONFIG_BT_NIMBLE_HS_FLOW_CTRL=y
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=512
CONFIG_UART_ISR_IN_IRAM=y
CONFIG_HTTPD_MAX_REQ_HDR_LEN=2048
CONFIG_HTTPD_MAX_URI_LEN=2048
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MEMTEST=n
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=512
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# ---------------------------------------------------------------------------
# Internal RAM budget.
#
# DIRAM is 341,760 bytes and it is the ONLY memory that can hold FreeRTOS task
# stacks, DMA buffers, or anything touched while the flash cache is off. PSRAM is
# 8 MB and effectively free, but can do none of those jobs. Flash likewise has over
# a megabyte spare -- pruning assets or menus buys nothing here, because they are
# not what is scarce.
#
# Measured 2026-07-31: 241,955 bytes (70.8%) gone to the static image before
# app_main runs, leaving ~97 KB for every task stack and driver buffer combined.
# Observed steady state was ~18 KB free with a largest contiguous block of 7,680
# bytes -- which is why an 8 KB task stack request failed while "megabytes free"
# was technically true. Every crash this session traces back to this line item.
#
# Treat internal RAM as the budget it is: anything added here must be paid for.

# DO NOT bother disabling the *_IN_IRAM driver flags to reclaim IRAM. It was tried
# and measured on 2026-07-31: turning off RMT (x3), MCPWM, GPTIMER and SPI-slave
# changed .text in DIRAM by exactly ZERO bytes, 142,763 before and after. Those
# drivers are not linked into this firmware, so their ISRs never occupied IRAM to
# begin with -- an unused driver's IRAM flag costs nothing. "main/ does not use it"
# means there is nothing to save, not that there is something to save.
#
# The flags that WOULD matter are the ones for peripherals actually in use -- SPI
# master (LCD), I2C master (touch, IMU, codec), UART (console), GDMA -- and those
# are on genuine cache-off paths, where disabling them trades a few KB for
# heisenbugs that only appear during flash writes. Not worth it.

# USB-NCM's NTB buffers are DMA buffers, so they are internal RAM by necessity:
# (3 x 3200) + (3 x 3200) = 19,200 bytes, the single largest runtime consumer on
# the device. 2 x 2048 each way is 8,192 -- an 11 KB saving for slightly lower USB
# throughput on a link used for debugging and audio, neither of which is close to
# saturating it.
CONFIG_TINYUSB_NCM_OUT_NTB_BUFFS_COUNT=2
CONFIG_TINYUSB_NCM_IN_NTB_BUFFS_COUNT=2
CONFIG_TINYUSB_NCM_OUT_NTB_BUFF_MAX_SIZE=2048
CONFIG_TINYUSB_NCM_IN_NTB_BUFF_MAX_SIZE=2048

# lwIP's tcpip task ("tiT"). ESP-IDF's stock default is 3072, which was fine while
# this device had exactly one network interface. It is not fine with two: enabling
# WiFi alongside USB-NCM made one task service both netifs plus DHCP and DNS, and it
# overflowed -- confirmed from a core dump, "A stack overflow in task tiT has been
# detected" in vApplicationStackOverflowHook.
#
# It presented as an INTERMITTENT crash a few seconds after boot, stable afterwards,
# because whether it overflows depends on what happens to be on the stack when the
# second interface does something. That is worth remembering: an intermittent
# post-boot crash right after adding a netif is this, until proven otherwise.
#
# 8192 because WireGuard adds a THIRD netif and runs its Noise handshake -- X25519,
# blake2s HMAC -- in lwIP's context, on this stack. X25519 alone is typically 1-2 KB.
#
# Measured with two netifs and no tailnet: peak 3,008 bytes, so 6144 was ample there.
# Raised pre-emptively rather than after a crash, because /debug reports
# tcpip_stack_free_min and the peak can simply be read back once the tailnet is up --
# lowering it later with a measurement in hand is cheap, whereas discovering the
# overflow costs a boot loop and a physical reset per attempt.
CONFIG_LWIP_TCPIP_TASK_STACK_SIZE=8192
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=3
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=6
CONFIG_ESP_WIFI_DYNAMIC_RX_MGMT_BUFFER=y
CONFIG_ESP_WIFI_RX_BA_WIN=3
CONFIG_ESP_WIFI_IRAM_OPT=n
CONFIG_ESP_WIFI_RX_IRAM_OPT=n
CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT=n
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=16
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CONFIG_DATA=y
CONFIG_MBEDTLS_SSL_KEEP_PEER_CERTIFICATE=n
CONFIG_MBEDTLS_SSL_RENEGOTIATION=n
CONFIG_LIBC_NEWLIB_NANO_FORMAT=y
CONFIG_CAMERA_GC0308=y
CONFIG_CAMERA_GC0308_DVP_YUV422_320X240_20FPS=y
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_CLIB_SPRINTF=y
CONFIG_LV_USE_ASSERT_STYLE=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_FMT_TXT_LARGE=y
CONFIG_LV_USE_FONT_PLACEHOLDER=n
CONFIG_LV_USE_ANIMIMG=n
CONFIG_LV_USE_KEYBOARD=n
CONFIG_LV_USE_LED=n
CONFIG_LV_USE_LIST=n
CONFIG_LV_USE_MENU=n
CONFIG_LV_USE_MSGBOX=n
CONFIG_LV_USE_SPAN=n
CONFIG_LV_USE_SPINBOX=n
CONFIG_LV_USE_TABVIEW=n
CONFIG_LV_USE_TILEVIEW=n
CONFIG_LV_USE_WIN=n
CONFIG_LV_USE_LODEPNG=y
CONFIG_LV_USE_QRCODE=y
CONFIG_LV_USE_SNAPSHOT=y
CONFIG_LV_USE_IMGFONT=y
CONFIG_LV_BUILD_EXAMPLES=n
CONFIG_LV_BUILD_DEMOS=n
